"""
Это ваша первая задача. В ней вам придётся прочитать два числа и сложить их.
Результат необходимо вывести на стандартный поток вывода или в файл,
указанный в условии задачи.
Рекомендуем воспользоваться заготовками кода для данной задачи,
лежащими в репозитории курса.

Формат ввода
В первой строке задано первое число, во второй – второе.
Оба числа лежат в диапазоне от −10**9 до 10**9
.
Формат вывода
Выведите единственное число – результат сложения двух чисел.
"""

# Прочитали число на первой строке и привели к целому типу.
a = int(input())
# Сделали то же самое с числом на второй строке.
b = int(input())
print(a + b)
